Simsoniteee/TestRepo/F2837x_spi_tlc549/device/driverlib/inc/hw_hrpwm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GLDCTL register
//
//*****************************************************************************
#define HRPWM_GLDCTL_GLD          0x1U         // Global Shadow to Active load
                                               // event control
#define HRPWM_GLDCTL_GLDMODE_S    1U
#define HRPWM_GLDCTL_GLDMODE_M    0x1EU        // Shadow to Active Global Load
                                               // Pulse Selection
#define HRPWM_GLDCTL_OSHTMODE     0x20U        // One Shot Load mode control
                                               // bit
#define HRPWM_GLDCTL_GLDPRD_S     7U
#define HRPWM_GLDCTL_GLDPRD_M     0x380U       // Global Reload Strobe Period
                                               // Select Register
#define HRPWM_GLDCTL_GLDCNT_S     10U
#define HRPWM_GLDCTL_GLDCNT_M     0x1C00U      // Global Reload Strobe Counter
                                               // Register

//*****************************************************************************
//
// The following are defines for the bit fields in the GLDCFG register
//
//*****************************************************************************
#define HRPWM_GLDCFG_TBPRD_TBPRDHR  0x1U         // Global load event
                                               // configuration for TBPRD:TBPRDHR
#define HRPWM_GLDCFG_CMPA_CMPAHR  0x2U         // Global load event
                                               // configuration for CMPA:CMPAHR
#define HRPWM_GLDCFG_CMPB_CMPBHR  0x4U         // Global load event
                                               // configuration for CMPB:CMPBHR
#define HRPWM_GLDCFG_CMPC         0x8U         // Global load event
                                               // configuration for CMPC
#define HRPWM_GLDCFG_CMPD         0x10U        // Global load event
                                               // configuration for CMPD
#define HRPWM_GLDCFG_DBRED_DBREDHR  0x20U        // Global load event
                                               // configuration for DBRED:DBREDHR
#define HRPWM_GLDCFG_DBFED_DBFEDHR  0x40U        // Global load event
                                               // configuration for DBFED:DBFEDHR
#define HRPWM_GLDCFG_DBCTL        0x80U        // Global load event
                                               // configuration for DBCTL
#define HRPWM_GLDCFG_AQCTLA_AQCTLA2  0x100U       // Global load event
                                               // configuration for AQCTLA/A2
#define HRPWM_GLDCFG_AQCTLB_AQCTLB2  0x200U       // Global load event
                                               // configuration for AQCTLB/B2
#define HRPWM_GLDCFG_AQCSFRC      0x400U       // Global load event
                                               // configuration for AQCSFRC

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWMXLINK register
//
//*****************************************************************************
#define HRPWM_XLINK_TBPRDLINK_S   0U
#define HRPWM_XLINK_TBPRDLINK_M   0xFU        // TBPRD:TBPRDHR  Link
#define HRPWM_XLINK_CMPALINK_S    4U
#define HRPWM_XLINK_CMPALINK_M    0xF0U       // CMPA:CMPAHR Link
#define HRPWM_XLINK_CMPBLINK_S    8U
#define HRPWM_XLINK_CMPBLINK_M    0xF00U      // CMPB:CMPBHR Link
#define HRPWM_XLINK_CMPCLINK_S    12U
#define HRPWM_XLINK_CMPCLINK_M    0xF000U     // CMPC Link
#define HRPWM_XLINK_CMPDLINK_S    16U
#define HRPWM_XLINK_CMPDLINK_M    0xF0000U    // CMPD Link
#define HRPWM_XLINK_GLDCTL2LINK_S  28U
#define HRPWM_XLINK_GLDCTL2LINK_M  0xF0000000U // GLDCTL2 Link

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTLA register
//
//*****************************************************************************
#define HRPWM_AQCTLA_ZRO_S        0U
#define HRPWM_AQCTLA_ZRO_M        0x3U         // Action Counter = Zero
#define HRPWM_AQCTLA_PRD_S        2U
#define HRPWM_AQCTLA_PRD_M        0xCU         // Action Counter = Period
#define HRPWM_AQCTLA_CAU_S        4U
#define HRPWM_AQCTLA_CAU_M        0x30U        // Action Counter = Compare A Up
#define HRPWM_AQCTLA_CAD_S        6U
#define HRPWM_AQCTLA_CAD_M        0xC0U        // Action Counter = Compare A
                                               // Down
#define HRPWM_AQCTLA_CBU_S        8U
#define HRPWM_AQCTLA_CBU_M        0x300U       // Action Counter = Compare B Up
#define HRPWM_AQCTLA_CBD_S        10U
#define HRPWM_AQCTLA_CBD_M        0xC00U       // Action Counter = Compare B
                                               // Down

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTLA2 register
//
//*****************************************************************************
#define HRPWM_AQCTLA2_T1U_S       0U
#define HRPWM_AQCTLA2_T1U_M       0x3U         // Action when event occurs on
                                               // T1 in UP-Count
#define HRPWM_AQCTLA2_T1D_S       2U
#define HRPWM_AQCTLA2_T1D_M       0xCU         // Action when event occurs on
                                               // T1 in DOWN-Count
#define HRPWM_AQCTLA2_T2U_S       4U
#define HRPWM_AQCTLA2_T2U_M       0x30U        // Action when event occurs on
                                               // T2 in UP-Count
#define HRPWM_AQCTLA2_T2D_S       6U
#define HRPWM_AQCTLA2_T2D_M       0xC0U        // Action when event occurs on
                                               // T2 in DOWN-Count

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTLB register
//
//*****************************************************************************
#define HRPWM_AQCTLB_ZRO_S        0U
#define HRPWM_AQCTLB_ZRO_M        0x3U         // Action Counter = Zero
#define HRPWM_AQCTLB_PRD_S        2U
#define HRPWM_AQCTLB_PRD_M        0xCU         // Action Counter = Period
#define HRPWM_AQCTLB_CAU_S        4U
#define HRPWM_AQCTLB_CAU_M        0x30U        // Action Counter = Compare A Up
#define HRPWM_AQCTLB_CAD_S        6U
#define HRPWM_AQCTLB_CAD_M        0xC0U        // Action Counter = Compare A
                                               // Down
#define HRPWM_AQCTLB_CBU_S        8U
#define HRPWM_AQCTLB_CBU_M        0x300U       // Action Counter = Compare B Up
#define HRPWM_AQCTLB_CBD_S        10U
#define HRPWM_AQCTLB_CBD_M        0xC00U       // Action Counter = Compare B
                                               // Down

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCTLB2 register
//
//*****************************************************************************
#define HRPWM_AQCTLB2_T1U_S       0U
#define HRPWM_AQCTLB2_T1U_M       0x3U         // Action when event occurs on
                                               // T1 in UP-Count
#define HRPWM_AQCTLB2_T1D_S       2U
#define HRPWM_AQCTLB2_T1D_M       0xCU         // Action when event occurs on
                                               // T1 in DOWN-Count
#define HRPWM_AQCTLB2_T2U_S       4U
#define HRPWM_AQCTLB2_T2U_M       0x30U        // Action when event occurs on
                                               // T2 in UP-Count
#define HRPWM_AQCTLB2_T2D_S       6U
#define HRPWM_AQCTLB2_T2D_M       0xC0U        // Action when event occurs on
                                               // T2 in DOWN-Count

//*****************************************************************************
//
// The following are defines for the bit fields in the AQSFRC register
//
//*****************************************************************************
#define HRPWM_AQSFRC_ACTSFA_S     0U
#define HRPWM_AQSFRC_ACTSFA_M     0x3U         // Action when One-time SW Force
                                               // A Invoked
#define HRPWM_AQSFRC_OTSFA        0x4U         // One-time SW Force A Output
#define HRPWM_AQSFRC_ACTSFB_S     3U
#define HRPWM_AQSFRC_ACTSFB_M     0x18U        // Action when One-time SW Force
                                               // B Invoked
#define HRPWM_AQSFRC_OTSFB        0x20U        // One-time SW Force A Output
#define HRPWM_AQSFRC_RLDCSF_S     6U
#define HRPWM_AQSFRC_RLDCSF_M     0xC0U        // Reload from Shadow Options

//*****************************************************************************
//
// The following are defines for the bit fields in the AQCSFRC register
//
//*****************************************************************************
#define HRPWM_AQCSFRC_CSFA_S      0U
#define HRPWM_AQCSFRC_CSFA_M      0x3U         // Continuous Software Force on
                                               // output A
#define HRPWM_AQCSFRC_CSFB_S      2U
#define HRPWM_AQCSFRC_CSFB_M      0xCU         // Continuous Software Force on
                                               // output B

//*****************************************************************************
//
// The following are defines for the bit fields in the DBREDHR register
//
//*****************************************************************************
#define HRPWM_DBREDHR_DBREDHR_S   9U
#define HRPWM_DBREDHR_DBREDHR_M   0xFE00U      // DBREDHR High Resolution Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the DBRED register
//
//*****************************************************************************
#define HRPWM_DBRED_DBRED_S       0U
#define HRPWM_DBRED_DBRED_M       0x3FFFU      // Rising edge delay value

//*****************************************************************************
//
// The following are defines for the bit fields in the DBFEDHR register
//
//*****************************************************************************
#define HRPWM_DBFEDHR_DBFEDHR_S   9U
#define HRPWM_DBFEDHR_DBFEDHR_M   0xFE00U      // DBFEDHR High Resolution Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the DBFED register
//
//*****************************************************************************
#define HRPWM_DBFED_DBFED_S       0U
#define HRPWM_DBFED_DBFED_M       0x3FFFU      // Falling edge delay value

//*****************************************************************************
//
// The following are defines for the bit fields in the TBPHS register
//
//*****************************************************************************
#define HRPWM_TBPHS_TBPHSHR_S     0U
#define HRPWM_TBPHS_TBPHSHR_M     0xFFFFU      // Extension Register for HRPWM
                                               // Phase (8-bits)
#define HRPWM_TBPHS_TBPHS_S       16U
#define HRPWM_TBPHS_TBPHS_M       0xFFFF0000U  // Phase Offset Register

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPA register
//
//*****************************************************************************
#define HRPWM_CMPA_CMPAHR_S       0U
#define HRPWM_CMPA_CMPAHR_M       0xFFFFU      // Compare A HRPWM Extension
                                               // Register
#define HRPWM_CMPA_CMPA_S         16U
#define HRPWM_CMPA_CMPA_M         0xFFFF0000U  // Compare A Register

//*****************************************************************************
//
// The following are defines for the bit fields in the CMPB register
//
//*****************************************************************************
#define HRPWM_CMPB_CMPBHR_S       0U
#define HRPWM_CMPB_CMPBHR_M       0xFFFFU      // Compare B High Resolution
                                               // Bits
#define HRPWM_CMPB_CMPB_S         16U
#define HRPWM_CMPB_CMPB_M         0xFFFF0000U  // Compare B Register

//*****************************************************************************
//
// The following are defines for the bit fields in the GLDCTL2 register
//
//*****************************************************************************
#define HRPWM_GLDCTL2_OSHTLD      0x1U         // Enable reload event in one
                                               // shot mode
#define HRPWM_GLDCTL2_GFRCLD      0x2U         // Force reload event in one
                                               // shot mode

//*****************************************************************************
//
// The following are defines for the bit fields in the TZSEL register
//
//*****************************************************************************
#define HRPWM_TZSEL_CBC1          0x1U         // TZ1 CBC select
#define HRPWM_TZSEL_CBC2          0x2U         // TZ2 CBC select
#define HRPWM_TZSEL_CBC3          0x4U         // TZ3 CBC select
#define HRPWM_TZSEL_CBC4          0x8U         // TZ4 CBC select
#define HRPWM_TZSEL_CBC5          0x10U        // TZ5 CBC select
#define HRPWM_TZSEL_CBC6          0x20U        // TZ6 CBC select
#define HRPWM_TZSEL_DCAEVT2       0x40U        // DCAEVT2 CBC select
#define HRPWM_TZSEL_DCBEVT2       0x80U        // DCBEVT2 CBC select
#define HRPWM_TZSEL_OSHT1         0x100U       // One-shot TZ1 select
#define HRPWM_TZSEL_OSHT2         0x200U       // One-shot TZ2 select
#define HRPWM_TZSEL_OSHT3         0x400U       // One-shot TZ3 select
#define HRPWM_TZSEL_OSHT4         0x800U       // One-shot TZ4 select
#define HRPWM_TZSEL_OSHT5         0x1000U      // One-shot TZ5 select
#define HRPWM_TZSEL_OSHT6         0x2000U      // One-shot TZ6 select
#define HRPWM_TZSEL_DCAEVT1       0x4000U      // One-shot DCAEVT1 select
#define HRPWM_TZSEL_DCBEVT1       0x8000U      // One-shot DCBEVT1 select

//*****************************************************************************
//
// The following are defines for the bit fields in the TZDCSEL register
//
//*****************************************************************************
#define HRPWM_TZDCSEL_DCAEVT1_S   0U
#define HRPWM_TZDCSEL_DCAEVT1_M   0x7U         // Digital Compare Output A
                                               // Event 1
#define HRPWM_TZDCSEL_DCAEVT2_S   3U
#define HRPWM_TZDCSEL_DCAEVT2_M   0x38U        // Digital Compare Output A
                                               // Event 2
#define HRPWM_TZDCSEL_DCBEVT1_S   6U
#define HRPWM_TZDCSEL_DCBEVT1_M   0x1C0U       // Digital Compare Output B
                                               // Event 1
#define HRPWM_TZDCSEL_DCBEVT2_S   9U
#define HRPWM_TZDCSEL_DCBEVT2_M   0xE00U       // Digital Compare Output B
                                               // Event 2

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCTL register
//
//*****************************************************************************
#define HRPWM_TZCTL_TZA_S         0U
#define HRPWM_TZCTL_TZA_M         0x3U         // TZ1 to TZ6 Trip Action On
                                               // EPWMxA
#define HRPWM_TZCTL_TZB_S         2U
#define HRPWM_TZCTL_TZB_M         0xCU         // TZ1 to TZ6 Trip Action On
                                               // EPWMxB
#define HRPWM_TZCTL_DCAEVT1_S     4U
#define HRPWM_TZCTL_DCAEVT1_M     0x30U        // EPWMxA action on DCAEVT1
#define HRPWM_TZCTL_DCAEVT2_S     6U
#define HRPWM_TZCTL_DCAEVT2_M     0xC0U        // EPWMxA action on DCAEVT2
#define HRPWM_TZCTL_DCBEVT1_S     8U
#define HRPWM_TZCTL_DCBEVT1_M     0x300U       // EPWMxB action on DCBEVT1
#define HRPWM_TZCTL_DCBEVT2_S     10U
#define HRPWM_TZCTL_DCBEVT2_M     0xC00U       // EPWMxB action on DCBEVT2

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCTL2 register
//
//*****************************************************************************
#define HRPWM_TZCTL2_TZAU_S       0U
#define HRPWM_TZCTL2_TZAU_M       0x7U         // Trip Action On EPWMxA while
                                               // Count direction is UP
#define HRPWM_TZCTL2_TZAD_S       3U
#define HRPWM_TZCTL2_TZAD_M       0x38U        // Trip Action On EPWMxA while
                                               // Count direction is DOWN
#define HRPWM_TZCTL2_TZBU_S       6U
#define HRPWM_TZCTL2_TZBU_M       0x1C0U       // Trip Action On EPWMxB while
                                               // Count direction is UP
#define HRPWM_TZCTL2_TZBD_S       9U
#define HRPWM_TZCTL2_TZBD_M       0xE00U       // Trip Action On EPWMxB while
                                               // Count direction is DOWN
#define HRPWM_TZCTL2_ETZE         0x8000U      // TZCTL2 Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCTLDCA register
//
//*****************************************************************************
#define HRPWM_TZCTLDCA_DCAEVT1U_S  0U
#define HRPWM_TZCTLDCA_DCAEVT1U_M  0x7U         // DCAEVT1 Action On EPWMxA
                                               // while Count direction is UP
#define HRPWM_TZCTLDCA_DCAEVT1D_S  3U
#define HRPWM_TZCTLDCA_DCAEVT1D_M  0x38U        // DCAEVT1 Action On EPWMxA
                                               // while Count direction is DOWN
#define HRPWM_TZCTLDCA_DCAEVT2U_S  6U
#define HRPWM_TZCTLDCA_DCAEVT2U_M  0x1C0U       // DCAEVT2 Action On EPWMxA
                                               // while Count direction is UP
#define HRPWM_TZCTLDCA_DCAEVT2D_S  9U
#define HRPWM_TZCTLDCA_DCAEVT2D_M  0xE00U       // DCAEVT2 Action On EPWMxA
                                               // while Count direction is DOWN

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCTLDCB register
//
//*****************************************************************************
#define HRPWM_TZCTLDCB_DCBEVT1U_S  0U
#define HRPWM_TZCTLDCB_DCBEVT1U_M  0x7U         // DCBEVT1 Action On EPWMxA
                                               // while Count direction is UP
#define HRPWM_TZCTLDCB_DCBEVT1D_S  3U
#define HRPWM_TZCTLDCB_DCBEVT1D_M  0x38U        // DCBEVT1 Action On EPWMxA
                                               // while Count direction is DOWN
#define HRPWM_TZCTLDCB_DCBEVT2U_S  6U
#define HRPWM_TZCTLDCB_DCBEVT2U_M  0x1C0U       // DCBEVT2 Action On EPWMxA
                                               // while Count direction is UP
#define HRPWM_TZCTLDCB_DCBEVT2D_S  9U
#define HRPWM_TZCTLDCB_DCBEVT2D_M  0xE00U       // DCBEVT2 Action On EPWMxA
                                               // while Count direction is DOWN

//*****************************************************************************
//
// The following are defines for the bit fields in the TZEINT register
//
//*****************************************************************************
#define HRPWM_TZEINT_CBC          0x2U         // Trip Zones Cycle By Cycle Int
                                               // Enable
#define HRPWM_TZEINT_OST          0x4U         // Trip Zones One Shot Int
                                               // Enable
#define HRPWM_TZEINT_DCAEVT1      0x8U         // Digital Compare A Event 1 Int
                                               // Enable
#define HRPWM_TZEINT_DCAEVT2      0x10U        // Digital Compare A Event 2 Int
                                               // Enable
#define HRPWM_TZEINT_DCBEVT1      0x20U        // Digital Compare B Event 1 Int
                                               // Enable
#define HRPWM_TZEINT_DCBEVT2      0x40U        // Digital Compare B Event 2 Int
                                               // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the TZFLG register
//
//*****************************************************************************
#define HRPWM_TZFLG_INT           0x1U         // Global Int Status Flag
#define HRPWM_TZFLG_CBC           0x2U         // Trip Zones Cycle By Cycle
                                               // Flag
#define HRPWM_TZFLG_OST           0x4U         // Trip Zones One Shot Flag
#define HRPWM_TZFLG_DCAEVT1       0x8U         // Digital Compare A Event 1
                                               // Flag
#define HRPWM_TZFLG_DCAEVT2       0x10U        // Digital Compare A Event 2
                                               // Flag
#define HRPWM_TZFLG_DCBEVT1       0x20U        // Digital Compare B Event 1
                                               // Flag
#define HRPWM_TZFLG_DCBEVT2       0x40U        // Digital Compare B Event 2
                                               // Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the TZCBCFLG register
//
//*****************************************************************************
#define HRPWM_TZCBCFLG_CBC1       0x1U         // Latched Status Flag for CBC1
                                               // Trip Latch
#define HRPWM_TZCBCFLG_CBC2       0x2U         // Latched Status Flag for CBC2
                                               // Trip Latch
#define HRPWM_TZCBCFLG_CBC3       0x4U         // Latched Status Flag for CBC3
                                               // Trip Latch
#define HRPWM_TZCBCFLG_CBC4       0x8U         // Latched Status Flag for CBC4
                                               // Trip Latch
#define HRPWM_TZCBCFLG_CBC5       0x10U        // Latched Status Flag for CBC5
                                               // Trip Latch
#define HRPWM_TZCBCFLG_CBC6       0x20U        // Latched Status Flag for CBC6
                                               // Trip Latch
#define HRPWM_TZCBCFLG_DCAEVT2    0x40U        // Latched Status Flag for
                                               // Digital Compare Output A Event 2
#define HRPWM_TZCBCFLG_DCBEVT2    0x80U        // Latched Status Flag for
                                               // Digital Compare Output B Event 2

//*****************************************************************************
//
// The following are defines for the bit fields in the TZOSTFLG register
//
//*****************************************************************************
#define HRPWM_TZOSTFLG_OST1       0x1U         // Latched Status Flag for OST1
                                               // Trip Latch
#define HRPWM_TZOSTFLG_OST2       0x2U         // Latched Status Flag for OST2
                                               // Trip Latch
#define HRPWM_TZOSTFLG_OST3       0x4U         // Latched Status Flag for OST3
                                               // Trip Latch
#define HRPWM_TZOSTFLG_OST4       0x8U         // Latched Status Flag for OST4
                                               // Trip Latch
#define HRPWM_TZOSTFLG_OST5       0x10U        // Latched Status Flag for OST5
                                               // Trip Latch
#define HRPWM_TZOSTFLG_OST6       0x20U        // Latched Status Flag for OST6
                                               // Trip Latch
#define HRPWM_TZOSTFLG_DCAEVT1    0x40U        // Latched Status Flag for
                                               // Digital Compare Output A Event 1
#define HRPWM_TZOSTFLG_DCBEVT1    0x80U        // Latched Status Flag for
                                               // Digital Compare Output B Event 1

